# Написать программу, которая принимает на вход число и выдаёт его квадрат.

number = int(input('Введите число: '))

print(f'{number} * {number} = {number ** 2}')
